Catalogs/CRM_ПлановыеРезультатыКонтактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>CRM_ПлановыеРезультатыКонтактов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВесаОценок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_ОценкаУдовлетворенностиКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/CRM_ОценкаУдовлетворенностиКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ОценкаУдовлетворенностиКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Плохо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хорошо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/CRM_ПлановыеРезультатыКонтактов/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьОценки(Команда)
	
	ИмеющиесяВеса = Новый Соответствие;
	Для Каждого Вес Из Объект.ВесаОценок Цикл
		ИмеющиесяВеса.Вставить(Вес.Оценка, Вес.Вес);
	КонецЦикла;
	Объект.ВесаОценок.Очистить();
	Стр = Объект.ВесаОценок.Добавить();
	Стр.Оценка = ПредопределенноеЗначение("Перечисление.CRM_ОценкаУдовлетворенностиКлиента.Плохо");
	Стр.Вес = ИмеющиесяВеса[Стр.Оценка];
	Стр = Объект.ВесаОценок.Добавить();
	Стр.Оценка = ПредопределенноеЗначение("Перечисление.CRM_ОценкаУдовлетворенностиКлиента.Хорошо");
	Стр.Вес = ИмеющиесяВеса[Стр.Оценка];
	
КонецПроцедуры
